;; ************************************************************************************
;; OneLocale_Demo-[de].lang
;; save this file as UTF-16 w/ BOM (Byte Order Mark)
;; • you may translate these user-interface values to the language of your choice
;;   (save with a new language tag)
;; ******************************************************
[General]
;; • 'Version' must match that of the main script
version     = 1.4
lang_id     = de
lang_name   = German
app_name    = OneLocale_Demo
description = OneLocale Test & Demo für AHKv2
translator  = Google
date        =
comment     =

;; EXTENDERS SECTION:
;; • Has a list of paths that 'extends' this file; if the requested Section
;;   or Key value is not found, it looks in the listed file(s)
;; • May be absolute or relative to this file
[:extenders:]
..\..\..\lib\OneLocale_Dialog-template.lang
..\..\..\lib\Versions-template.lang

;; TRANSLATORS:
;; • Keep veriables (%title%) unchanged.
;; • Any text to the right of '\z' is a comment to help you in translating.
;;   You may add to those comments if it helps other translators.
;; • Save with new name, with your language tag in the brackets.
;;   https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-lcid/a9eac961-e77d-41a6-90a5-ce1a8b0cdb9c
;; • Save as UTF-16 w/ BOM (Byte Order Mark) to preserve Unicode
;;   (a .lang file IS a type of .ini file)

;; Menus:
;; • Ampersand ('&') sets the Accesss Key
;;   • Choose the appropriate key for your language
;;   • Make them unique within a menu, if possible
;; • Tab ('\t') separates menu text and menu Accelerator
;;   • Choose the appropriate hotkey for your language
;;   • Make them unique within a GUI, if possible
[menu]
language    = &Sprache...\tCtrl+S
file_test   = &Fehlermeldung generieren\tCtrl+F
file_quit   = &Beenden\tCtrl+B
help_read   = &Readme im Browser anzeigen...\tF1
mnu_file    = &Datei
mnu_help    = &Helfen

;; GUI elements:
;; • Ampersand ('&') sets the Access Key
;;   • Choose the appropriate key for your language
;;   • Make them unique within a GUI, if possible
;; • Watch out for translated strings becoming too long to display propery; experiment.
;; • As a rule of thumb, messages should be no more than ~120% longer than base language.
[gui]
title       = %title% - Ausführung %ver% \z\\ any text after '\z' is a comment to the translator.
ctlText1    = Geben Sie das heutige Datum ein:
ctlChk1     = &Möglichkeit 1
btn_Error   = &Test
btn_Help    = &Helfen
btn_Browse  = &Browse…
btn_Quit    = Ausfahrt

;; Tooltips:
;; • There are no access keys or accelerators.
;; • No length restriction - tooltips can grow to display a lot of text.
[tooltips]
ctlEdit1    = Hier noch etwas Hilfe zu diesem Eintrag.
ctlList1    = Wählen Sie eine Farbe aus der Liste.
ctlChk1     = Diese Option bewirkt nichts.
btn_Error   = Erstellen Sie eine gefälschte Fehlermeldung
btn_Help    = Lese die readme Datei.
multiline   = Mehrzeiliger Test.
btn_Browse  = Browse for a file.

;; List contents:
;; • There are no hotkeys or accelerator keys
[list]
Red         = Rot
Green       = Grün
Blue        = Blau

;; Multiline text, without '=' on every line:
;; • Entire section should be translated
;; * Indent text with '\t'
;; * Add line breaks with '\n'
;; * Pay attention to display limits
[multiline]
→ Mehrzeiliger Text:
“Wer mit Ungeheuern kämpft, mag zusehn,
dass er nicht dabei zum Ungeheuer wird.
Und wenn du lange in einen Abgrund blickst,
blickt der Abgrund auch in dich hinein.” \n—Nietzsche

[dialog_browse]
title  = Select a text file
filter = Text Files \z (*.txt, *.ahk)

;; • Language chooser dialog:
;; * This is a new Gui with its own access keys and accelerators.
;[dialog_lang]
;title       = Change Language
;lbl_lang    = User Interface Language:
;lbl_buttons = App will restart if you change Language \n (work in progress will be lost)
;btn_OK      = OK
;btn_Cancel  = Cancel

;; • Language chooser dialog
;[tooltips_dialog_lang]
;lang_list   = Set User Interface Language

;; Error messages:
;; • Length doesn't have to be as limited (200-300% longer than base language is okay)
[errors]
bad_path                         = Die Datei \n'%path%' \n konnte nicht gefunden werden.
;OneLocaleDlg_ini_write_error    = Could not write to configuration file\n %path%
;OneLocaleDlg_lang_not_found     = 'Language' entry in .INI file \n '%ini_path%' \n not found
;OneLocaleDlg_newname_not_found  = Unexpected error: Language file not found for '%newname%'.

